# Программа должна запрашивать два числа и выводить результат их сложения, вычитания, умножения и деления.

print("==========================================")
print ("Консольный калькулятор. Версия 0.1.")
print("==========================================")
a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))
n = input("Введите действие (+ - / *): ")

if n == "+":
    print("==========================================")
    print(f"Результат: {a + b}")
    print("==========================================")
elif n == "-":
    print("==========================================")
    print(f"Результат: {a - b}")
    print("==========================================")
elif n == "/":
    print("==========================================")
    print(f"Результат: {a / b}")
    print("==========================================")
elif n == "*":
    print("==========================================")
    print(f"Результат: {a * b}")
    print("==========================================")
else:
    print("==========================================")
    print("Ошибка! Попробуйте еще раз.")
    print("==========================================")